module QIT.Topology.Base where

open import QIT.Prelude
open import QIT.Prop
open import QIT.Relation.Subset
open import QIT.Topology.Subset

private
  variable
    ℓ𝓤 ℓ𝓟 ℓ𝓞 : Level

record Space (ℓ𝓤 ℓ𝓟 ℓ𝓞 : Level) : Set (lsuc (ℓ𝓤 ⊔ ℓ𝓟 ⊔ ℓ𝓞)) where
  field
    𝓤        : Set ℓ𝓤
    𝓞        : 𝓟 ℓ𝓟 𝓤 → Prop ℓ𝓞
    ∅∈𝓞      : 𝓞 ∅
    𝓤∈𝓞      : 𝓞 𝓤̇
    ⋃∈𝓞      : (I : Set) (X : I → 𝓟 ℓ𝓟 𝓤)
             → (∀ i → 𝓞 (X i))
             → 𝓞 (⋃ I X)
    ∩∈𝓞      : (X Y : 𝓟 ℓ𝓟 𝓤)
             → 𝓞 X → 𝓞 Y
             → 𝓞 (X ∩ Y)

⟨_⟩ : Space ℓ𝓤 ℓ𝓟 ℓ𝓞 → Set ℓ𝓤
⟨ A ⟩ = A .Space.𝓤

data 𝓞[_] {𝓤 : Set ℓ𝓤}
          (𝓞 : 𝓟 ℓ𝓟 𝓤 → Prop ℓ𝓞)
    : 𝓟 ℓ𝓟 𝓤
    → Prop (ℓ𝓤 ⊔ lsuc ℓ𝓟 ⊔ ℓ𝓞) where
  𝓞∈[𝓞]    : ∀ X → 𝓞 X → 𝓞[ 𝓞 ] X
  ∅∈[𝓞]    : 𝓞[ 𝓞 ] ∅
  𝓤∈[𝓞]    : 𝓞[ 𝓞 ] 𝓤̇
  ⋃∈[𝓞]    : (I : Set) (X : I → 𝓟 ℓ𝓟 𝓤)
            → (∀ i → 𝓞[ 𝓞 ] (X i))
            → 𝓞[ 𝓞 ] (⋃ I X)
  ∩∈[𝓞]    : (X Y : 𝓟 ℓ𝓟 𝓤)
            → 𝓞[ 𝓞 ] X → 𝓞[ 𝓞 ] Y
            → 𝓞[ 𝓞 ] (X ∩ Y)

FreeSpace
  : ∀ ℓ𝓞 → (𝓤 : Set ℓ𝓤)
  → (𝓞 : 𝓟 ℓ𝓟 𝓤 → Prop ℓ𝓞)
  → Space ℓ𝓤 ℓ𝓟 (ℓ𝓤 ⊔ lsuc ℓ𝓟 ⊔ ℓ𝓞)
FreeSpace ℓ𝓞 𝓤 𝓞 = record
  { 𝓤        = 𝓤
  ; 𝓞        = 𝓞[ 𝓞 ]
  ; ∅∈𝓞      = ∅∈[𝓞]
  ; 𝓤∈𝓞      = 𝓤∈[𝓞]
  ; ⋃∈𝓞      = ⋃∈[𝓞]
  ; ∩∈𝓞      = ∩∈[𝓞]
  }

record _⇒_
    {ℓ𝓟 ℓ𝓤₁ ℓ𝓞₁ ℓ𝓤₂ ℓ𝓞₂}
    (A : Space ℓ𝓤₁ ℓ𝓟 ℓ𝓞₁)
    (B : Space ℓ𝓤₂ ℓ𝓟 ℓ𝓞₂)
    : Set (lsuc ℓ𝓟 ⊔ ℓ𝓤₁ ⊔ ℓ𝓞₁ ⊔ ℓ𝓤₂ ⊔ ℓ𝓞₂) where
  constructor _,_
  module A = Space A
  module B = Space B
  field
    f  : A.𝓤 → B.𝓤
    f𝓞 : ∀ Y → B.𝓞 Y → A.𝓞 (λ x → Y (f x))

Restriction
  : ∀ {ℓ𝓤 ℓ𝓟 ℓ𝓞}
  → (A : Space ℓ𝓤 ℓ𝓟 ℓ𝓞)
  → (X : 𝓟 ℓ𝓟 (A .Space.𝓤))
  → Space (ℓ𝓤 ⊔ ℓ𝓟) ℓ𝓟 (ℓ𝓤 ⊔ lsuc ℓ𝓟 ⊔ ℓ𝓞)
Restriction {ℓ𝓤} {ℓ𝓟} {ℓ𝓞} A X = FreeSpace _ 𝓤Restr 𝓞Restr
  module _ where
  open Space A

  𝓤Restr : Set (ℓ𝓤 ⊔ ℓ𝓟)
  𝓤Restr = ΣP 𝓤 X

  data 𝓞Restr : 𝓟 ℓ𝓟 𝓤Restr → Prop (ℓ𝓤 ⊔ lsuc ℓ𝓟 ⊔ ℓ𝓞) where
    restrict : (Y : 𝓟 ℓ𝓟 𝓤) → 𝓞 Y → 𝓞Restr (λ (x , _) → Y x)

Inclusion
  : ∀ {ℓ𝓤 ℓ𝓟 ℓ𝓞}
  → (A : Space ℓ𝓤 ℓ𝓟 ℓ𝓞)
  → (X : 𝓟 ℓ𝓟 (A .Space.𝓤))
  → Restriction A X ⇒ A
Inclusion {ℓ𝓟 = ℓ𝓟} A X = fst , f𝓞
  where
  module A = Space A
  module B = Space (Restriction A X)

  f𝓞 : (Y : 𝓟 ℓ𝓟 A.𝓤) → A.𝓞 Y → B.𝓞 (λ (x , _) → Y x)
  f𝓞 Y A𝓞Y = 𝓞∈[𝓞] (λ (x , _) → Y x) (restrict Y A𝓞Y)

Space· : ∀ ℓ𝓤 ℓ𝓟 ℓ𝓞 → Set (lsuc (ℓ𝓤 ⊔ ℓ𝓟 ⊔ ℓ𝓞))
Space· ℓ𝓤 ℓ𝓟 ℓ𝓞 = Σ (Space ℓ𝓤 ℓ𝓟 ℓ𝓞) ⟨_⟩

-- We cannot lift on the subset level ℓ𝓟 because it appears negatively in the definition.
LiftSpace : ∀ ℓ𝓤' ℓ𝓞' {ℓ𝓤 ℓ𝓟 ℓ𝓞} → Space ℓ𝓤 ℓ𝓟 ℓ𝓞 → Space (ℓ𝓤 ⊔ ℓ𝓤') ℓ𝓟 (ℓ𝓞 ⊔ ℓ𝓞')
LiftSpace ℓ𝓤' ℓ𝓞' X = record
  { 𝓤 = Lift ℓ𝓤' 𝓤
  ; 𝓞 = λ A → LiftP ℓ𝓞' (𝓞 (λ x → A (lift x)))
  ; ∅∈𝓞 = liftp ∅∈𝓞
  ; 𝓤∈𝓞 = liftp 𝓤∈𝓞
  ; ⋃∈𝓞 = λ I A z → liftp (⋃∈𝓞 I (λ i x → A i (lift x)) (λ i → z i .lowerp))
  ; ∩∈𝓞 = λ A B z z₁ → liftp (∩∈𝓞 (λ x → A (lift x)) (λ x → B (lift x)) (z .lowerp) (z₁ .lowerp))
  }
  where open Space X
