open import QIT.Prelude

module QIT.Topology.Subset ⦃ a!c* : A!C ⦄ where

open import QIT.Prelude
open import QIT.Prop
open import Data.List
open import QIT.Relation.Subset

open Subset

infix 40 _×ˢ_ _+ˢ_

_×ˢ_ : ∀ {ℓ𝓤 ℓ𝓥 ℓ𝓟} {𝓤 : Set ℓ𝓤} {𝓥 : Set ℓ𝓥}
     → 𝓟 ℓ𝓟 𝓤 → 𝓟 ℓ𝓟 𝓥 → 𝓟 _ (𝓤 × 𝓥)
(X ×ˢ Y) (x , y) = x ∈ X ∧ y ∈ Y

⨅ˢ : ∀ {ℓJ ℓ𝓤 ℓ𝓟} (J : Set ℓJ) {𝓤 : J → Set ℓ𝓤}
     →  (Aᴶ : ∀ j → 𝓟 ℓ𝓟 (𝓤 j)) → 𝓟 (ℓJ ⊔ ℓ𝓟) (∀ j → 𝓤 j)
⨅ˢ J Aᴶ X = ∀ j → Aᴶ j (X j)


_+ˢ_ : ∀ {ℓ𝓤 ℓ𝓥 ℓ𝓟} {𝓤 : Set ℓ𝓤} {𝓥 : Set ℓ𝓥}
     → 𝓟 ℓ𝓟 𝓤 → 𝓟 ℓ𝓟 𝓥 → 𝓟 _ (𝓤 ⊎ 𝓥)
(X +ˢ Y) (inj₁ x) = x ∈ X
(X +ˢ Y) (inj₂ y) = y ∈ Y


⨆ˢ : ∀ {ℓJ ℓ𝓤 ℓ𝓟} (J : Set ℓJ) {𝓤 : J → Set ℓ𝓤}
     →  (Aᴶ : ∀ j → 𝓟 ℓ𝓟 (𝓤 j)) → 𝓟 _ (Σ J 𝓤)
⨆ˢ J Aᴶ (j , x) = x ∈ Aᴶ j
